bench-runs/write-n10000-c100-2026-08-29-12-54-10.txt

Summary:
  Total:	0.4590 secs
  Slowest:	0.0260 secs
  Fastest:	0.0004 secs
  Average:	0.0045 secs
  Requests/sec:	21786.9948
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [1217]	|■■■■■■■
  0.006 [7133]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [1481]	|■■■■■■■■
  0.011 [67]	|
  0.013 [1]	|
  0.016 [0]	|
  0.018 [0]	|
  0.021 [24]	|
  0.023 [44]	|
  0.026 [32]	|


Latency distribution:
  10%% in 0.0028 secs
  25%% in 0.0035 secs
  50%% in 0.0043 secs
  75%% in 0.0051 secs
  90%% in 0.0060 secs
  95%% in 0.0066 secs
  99%% in 0.0191 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0083 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0019 secs
  resp wait:	0.0043 secs, 0.0004 secs, 0.0155 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0022 secs

Status code distribution:
  [201]	10000 responses