bench-runs/write-n10000-c100-2026-08-29-13-03-07.txt

Summary:
  Total:	0.3991 secs
  Slowest:	0.0830 secs
  Fastest:	0.0002 secs
  Average:	0.0038 secs
  Requests/sec:	25055.5163
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [9897]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [3]	|
  0.025 [5]	|
  0.033 [14]	|
  0.042 [6]	|
  0.050 [9]	|
  0.058 [18]	|
  0.066 [21]	|
  0.075 [21]	|
  0.083 [5]	|


Latency distribution:
  10%% in 0.0022 secs
  25%% in 0.0027 secs
  50%% in 0.0033 secs
  75%% in 0.0039 secs
  90%% in 0.0046 secs
  95%% in 0.0052 secs
  99%% in 0.0149 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0077 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.0037 secs, 0.0002 secs, 0.0762 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0019 secs

Status code distribution:
  [201]	10000 responses