bench-runs/write-n10000-c100-2026-08-29-13-03-09.txt

Summary:
  Total:	0.3308 secs
  Slowest:	0.0191 secs
  Fastest:	0.0002 secs
  Average:	0.0032 secs
  Requests/sec:	30231.3454
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [1180]	|■■■■■■■
  0.004 [7117]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [1544]	|■■■■■■■■■
  0.008 [53]	|
  0.010 [5]	|
  0.012 [5]	|
  0.013 [2]	|
  0.015 [2]	|
  0.017 [62]	|
  0.019 [29]	|


Latency distribution:
  10%% in 0.0021 secs
  25%% in 0.0025 secs
  50%% in 0.0030 secs
  75%% in 0.0037 secs
  90%% in 0.0044 secs
  95%% in 0.0049 secs
  99%% in 0.0103 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0063 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0025 secs
  resp wait:	0.0030 secs, 0.0002 secs, 0.0139 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0024 secs

Status code distribution:
  [201]	10000 responses