bench-runs/write-n10000-c25-2026-08-28-18-12-44.txt

Summary:
  Total:	0.8563 secs
  Slowest:	0.0104 secs
  Fastest:	0.0003 secs
  Average:	0.0021 secs
  Requests/sec:	11677.6308
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [21]	|
  0.002 [7497]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [2425]	|■■■■■■■■■■■■■
  0.004 [28]	|
  0.005 [3]	|
  0.006 [0]	|
  0.007 [2]	|
  0.008 [12]	|
  0.009 [0]	|
  0.010 [11]	|


Latency distribution:
  10%% in 0.0018 secs
  25%% in 0.0019 secs
  50%% in 0.0021 secs
  75%% in 0.0023 secs
  90%% in 0.0025 secs
  95%% in 0.0026 secs
  99%% in 0.0030 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0015 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0021 secs, 0.0003 secs, 0.0081 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [201]	10000 responses