bench-runs/write-z40s-c100-2026-08-29-13-25-29.txt

Summary:
  Total:	40.0024 secs
  Slowest:	0.1013 secs
  Fastest:	0.0005 secs
  Average:	0.0040 secs
  Requests/sec:	32420.6298
  
  Total data:	24641181 bytes
  Size/request:	24 bytes

Response time histogram:
  0.000 [1]	|
  0.011 [999614]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.021 [220]	|
  0.031 [32]	|
  0.041 [42]	|
  0.051 [14]	|
  0.061 [22]	|
  0.071 [4]	|
  0.081 [7]	|
  0.091 [17]	|
  0.101 [27]	|


Latency distribution:
  10%% in 0.0022 secs
  25%% in 0.0025 secs
  50%% in 0.0030 secs
  75%% in 0.0035 secs
  90%% in 0.0040 secs
  95%% in 0.0044 secs
  99%% in 0.0053 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0115 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0050 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0027 secs
  resp wait:	0.0040 secs, 0.0004 secs, 0.0881 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0029 secs

Status code distribution:
  [201]	1000000 responses